/*
输出"魔方阵"。所谓魔方阵是指这样的方阵，它的每一行、每一列和对角线之和均相等。
例如，三阶魔方阵为
8 1 6
3 5 7
4 9 2
要求输出1～n^2的自然数构成的魔方阵。

*/

/*
解：魔方阵中各数的排列规律如下：
（1）1放在第一行中间一列。
（2）从2开始至n*n为止，各数依次按此规则存放：每一个数存放的行比前一个数的行数减一，
列数加一。
（3）如果上一个数的行数是1，则下一个数的行数是n。
（4）上一个数的列数为n时，下一个数的列数为1，行数减一。
（5） 如果按上面规则确定的位置上已经有数，或者上一个数时第1行第n列时，则把下一个数
放在上一个数的下面。
*/

#include<stdio.h> 
int main()
{
	int a[15][15], i, j, k, p, n;
	p = 1;
	while (p == 1)
	{
		printf("enter n(n=1--15):");
		scanf("%d", &n);
		if ((n != 0) && (n < 15) && (n % 2 != 0))
		{
			p = 0;
		}
	}
	// 初始化
	for (i = 1; i <= n; i++)
	{
		for (j = 1; j <= n; j++)
		{
			a[i][j] = 0;
		}
	}
	// 建立魔方阵 
	j = n / 2 + 1;
	a[1][j] = 1;
	for (k = 2; k <= n * n; k++)
	{
		i = i - 1;
		j = j + 1;
		if ((i < 1) && (j > n))
		{
			i = i + 2;
			j = j - 1;
		}
		else
		{
			if (i < 1)i = n;
			if (j > n)j = 1;
		}
		if (a[i][j] == 0)
		{
			a[i][j] = k;
		}
		else {
			i = i + 2;
			j = j - 1;
			a[i][j] = k;
		}
	}
	// 输出魔方阵
	for (i = 1; i <= n; i++)
	{
		for (j = 1; j <= n; j++)
		{
			printf("%5d", a[i][j]);
		}
		printf("\n");
	}
	return 0;
}


