// 输出杨辉三角（要求输出十行） 
/*
杨辉三角各行系数有以下规律：
（1）各行第一个数都是1。
（2）各行最后一个数都是1。
（3）从第三行起，除了上面指出的第一个数和最后一个数外，其余各数是上一行同列和前一列
两个数之和。
a[i][j]=a[i-1][j]+a[i-1][j-1]
*/
#include<stdio.h>
#define N 10
int main()
{
	int i, j, a[N][N];
	for (i = 0; i < N; i++)
	{
		a[i][i] = 1; 	// 对角线上元素值为1
		a[i][0] = 1; // 第1列元素值为1 
	}
	for (i = 2; i < N; i++)
		for (j = 1; j <= i - 1; j++)
		{
			a[i][j] = a[i - 1][j - 1] + a[i - 1][j];
		}
	for (i = 0; i < N; i++)
	{
		for (j = 0; j <= i; j++)
		{
			printf("%6d", a[i][j]);
		}
		printf("\n");
	}
	printf("\n");
	return 0;
}

