#include <stdio.h>
/*
* C 语言实例 - 五人分鱼
* https://www.runoob.com/cprogramming/c-examples.html
*/
/*
A、B、C、D、E 五人在某天夜里合伙去捕鱼，到第二天凌晨时都疲惫不堪，于是各自找地方睡觉。
日上三杆，A 第一个醒来，他将鱼分为五份，把多余的一条鱼扔掉，拿走自己的一份。
B 第二个醒来，也将鱼分为五份，把多余的一条鱼扔掉拿走自己的一份。 。
C、D、E依次醒来，也按同样的方法拿鱼。
问他们台伙至少捕了多少条鱼?以及每个人醒来时见到了多少鱼？
*/

int main()
{
    int n, x, j, k, l, m;
    for (n = 5;; n++) {
        j = 4 * (n - 1) / 5;
        k = 4 * (j - 1) / 5;
        l = 4 * (k - 1) / 5;
        m = 4 * (l - 1) / 5;
        if (n % 5 == 1 && j % 5 == 1 && k % 5 == 1 && l % 5 == 1 && m % 5 == 1) {
            printf("至少合伙捕鱼：%d条\n", n);
            printf("分别见到鱼的条数：%d %d %d %d\n", j, k, l, m);
            break;
        }
    }
    return 0;
}

/*
设 E 最后留下了 x 条鱼，并用每个人的名字代表其醒来时看到的鱼，则可得：
E = 5x/4 + 1
E + 4 = 5(x + 4)/4
E = 5(x + 4)/4 - 4
D = 5E/4 + 1 = 25(x + 4)/16 - 4
C = 5D/4 + 1 = 125(x + 4)/64 - 4
B = 5C/4 + 1 = 625(x + 4)/256 - 4
A = 5B/4 + 1 = 3125(x + 4)/1024 - 4
由于A为整数，故3125(x + 4)必须要能够整除1024，且当A取得整数后，由于B、C、D、E式中的分母256、64、16、4皆为1024的因数，也能一同取得整数.
易知当x + 4 = 1024时，A取得最小值3121
使用数学归纳法可得出公式：
至少捕到的鱼 = 人数^人数 - 人数 + 1
*/

int main()
{
    int i, n = 5;  // 人数
    int   num = pow(n, n) - n + 1; // 至少捕到的鱼
    printf("至少合伙捕鱼：%d条\n", num);
    printf("分别见到鱼的条数：");
    for (i = 0; i < n; i++, num = 4 * (num - 1) / 5)
    {
        printf("%d%c", num, i == n - 1 ? '\n' : ' ');
    }
}
