/*
企业发放的奖金根据利润提成。
利润I低于或等于100 000元的，奖金可提成10%;
利润高于100 000元，低于200 000元（100 000<I≤200 000）时，低于100 000元的部分按10%提成，
高于100 000元的部分，可提成7.5%;200 000<I≤400 000 时，低于200 000元的部分仍按上述办法提成（下同）。
高于 200 000元的部分按5%提成;
400 000<I≤600 000元时，高于400 000元的部分按3%提成;
600 000<I≤1 000 000 时，高于600 000元的部分按1.5%提成;
I>100000时，超过1000 000元的部分按1%提成。
从键盘输入当月利润I，求应发奖金总数。
要求∶
（1）用if语句编程序。（2）用switch语句编程序。
*/

#include<stdio.h> 
int main()
{
	int i;
	double bonus, bon1, bon2, bon4, bon6, bon10;
	bon1 = 100000 * 0.1;
	bon2 = bon1 + 100000 * 0.075;
	bon4 = bon2 + 100000 * 0.05;
	bon6 = bon4 + 100000 * 0.03;
	bon10 = bon6 + 400000 * 0.015;
	printf("请输入利润i:");
	scanf("%d", &i);
	if (i <= 100000)
		bonus = i * 0.1;
	else if (i <= 200000)
		bonus = bon1 + (i - 100000) * 0.0075;
	else if (i <= 400000)
		bonus = bon2 + (i - 200000) * 0.05;
	else if (i <= 1000000)
		bonus = bon4 + (i - 400000) * 0.03;
	else if (i <= 1000000)
		bonus = bon6 + (i - 600000) * 0.015;
	else
		bonus = bon10 + (i - 1000000) * 0.01;
	printf("奖金是:%10.2f\n", bonus);
	return 0;
}

